AlmAck/svdtonuttx/demo/h/da1470x_qspic2.h
/****************************************************************************
 * ./tmp/da1470x_qspic2.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_QSPIC2_H
#define __DA1470X_QSPIC2_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_QSPIC2_QSPIC2_AWRITECMD_OFFSET  0x0040 /* The way of writing in Auto mode when the external device is a serial SRAM */
#define DA1470X_QSPIC2_QSPIC2_BURSTBRK_OFFSET   0x0030 /* Read break sequence in Auto mode */
#define DA1470X_QSPIC2_QSPIC2_BURSTCMDA_OFFSET  0x000C /* The way of reading in Auto mode (command register A) */
#define DA1470X_QSPIC2_QSPIC2_BURSTCMDB_OFFSET  0x0010 /* The way of reading in Auto mode (command register B) */
#define DA1470X_QSPIC2_QSPIC2_CHCKERASE_OFFSET  0x0038 /* Check erase progress in Auto mode */
#define DA1470X_QSPIC2_QSPIC2_CTRLBUS_OFFSET    0x0000 /* SPI Bus control register for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_CTRLMODE_OFFSET   0x0004 /* Mode control register */
#define DA1470X_QSPIC2_QSPIC2_DUMMYDATA_OFFSET  0x0020 /* Send dummy clocks to SPI Bus for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_ERASECMDA_OFFSET  0x0028 /* The way of erasing in Auto mode (command register A) */
#define DA1470X_QSPIC2_QSPIC2_ERASECMDB_OFFSET  0x002C /* The way of erasing in Auto mode (command register B) */
#define DA1470X_QSPIC2_QSPIC2_ERASECTRL_OFFSET  0x0024 /* Erase control register */
#define DA1470X_QSPIC2_QSPIC2_GP_OFFSET         0x003C /* General purpose QSPIC2 register */
#define DA1470X_QSPIC2_QSPIC2_MEMBLEN_OFFSET    0x0044 /* External memory burst length configuration */
#define DA1470X_QSPIC2_QSPIC2_READDATA_OFFSET   0x001C /* Read data from SPI Bus for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_RECVDATA_OFFSET   0x0008 /* Received data for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_STATUSCMD_OFFSET  0x0034 /* The way of reading the status of external device in Auto mode */
#define DA1470X_QSPIC2_QSPIC2_STATUS_OFFSET     0x0014 /* The status register of the QSPI controller */
#define DA1470X_QSPIC2_QSPIC2_WRITEDATA_OFFSET  0x0018 /* Write data to SPI Bus for the Manual mode */

/* Register addresses *******************************************************/

#define DA1470X_QSPIC2_BASE                     0x26000000 /* QSPIC2 registers */

#define DA1470X_QSPIC2_QSPIC2_AWRITECMD         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_AWRITECMD_OFFSET) /* The way of writing in Auto mode when the external device is a serial SRAM */
#define DA1470X_QSPIC2_QSPIC2_BURSTBRK          (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_BURSTBRK_OFFSET) /* Read break sequence in Auto mode */
#define DA1470X_QSPIC2_QSPIC2_BURSTCMDA         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_BURSTCMDA_OFFSET) /* The way of reading in Auto mode (command register A) */
#define DA1470X_QSPIC2_QSPIC2_BURSTCMDB         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_BURSTCMDB_OFFSET) /* The way of reading in Auto mode (command register B) */
#define DA1470X_QSPIC2_QSPIC2_CHCKERASE         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_CHCKERASE_OFFSET) /* Check erase progress in Auto mode */
#define DA1470X_QSPIC2_QSPIC2_CTRLBUS           (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_CTRLBUS_OFFSET) /* SPI Bus control register for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_CTRLMODE          (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_CTRLMODE_OFFSET) /* Mode control register */
#define DA1470X_QSPIC2_QSPIC2_DUMMYDATA         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_DUMMYDATA_OFFSET) /* Send dummy clocks to SPI Bus for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_ERASECMDA         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_ERASECMDA_OFFSET) /* The way of erasing in Auto mode (command register A) */
#define DA1470X_QSPIC2_QSPIC2_ERASECMDB         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_ERASECMDB_OFFSET) /* The way of erasing in Auto mode (command register B) */
#define DA1470X_QSPIC2_QSPIC2_ERASECTRL         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_ERASECTRL_OFFSET) /* Erase control register */
#define DA1470X_QSPIC2_QSPIC2_GP                (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_GP_OFFSET) /* General purpose QSPIC2 register */
#define DA1470X_QSPIC2_QSPIC2_MEMBLEN           (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_MEMBLEN_OFFSET) /* External memory burst length configuration */
#define DA1470X_QSPIC2_QSPIC2_READDATA          (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_READDATA_OFFSET) /* Read data from SPI Bus for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_RECVDATA          (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_RECVDATA_OFFSET) /* Received data for the Manual mode */
#define DA1470X_QSPIC2_QSPIC2_STATUSCMD         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_STATUSCMD_OFFSET) /* The way of reading the status of external device in Auto mode */
#define DA1470X_QSPIC2_QSPIC2_STATUS            (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_STATUS_OFFSET) /* The status register of the QSPI controller */
#define DA1470X_QSPIC2_QSPIC2_WRITEDATA         (DA1470X_QSPIC2_BASE + DA1470X_QSPIC2_QSPIC2_WRITEDATA_OFFSET) /* Write data to SPI Bus for the Manual mode */

/* Register bit definitions *************************************************/


/* QSPIC2_AWRITECMD Register */

#define QSPIC2_QSPIC_WR_CS_HIGH_MIN_MASK        (0x1F << 14) /* After the execution of the write command, the QSPI_CS remains high for at least  */
#define QSPIC2_QSPIC_WR_CS_HIGH_MIN_POS         (14) /* After the execution of the write command, the QSPI_CS remains high for at least  */
#define QSPIC2_QSPIC_WR_DAT_TX_MD_MASK          (0x3 << 12) /* The mode of the SPI Bus during the data phase of the write command. 0x0: Single  */
#define QSPIC2_QSPIC_WR_DAT_TX_MD_POS           (12) /* The mode of the SPI Bus during the data phase of the write command. 0x0: Single  */
#define QSPIC2_QSPIC_WR_ADR_TX_MD_MASK          (0x3 << 10) /* The mode of the SPI Bus during the adress phase of the write command. 0x0: Singl */
#define QSPIC2_QSPIC_WR_ADR_TX_MD_POS           (10) /* The mode of the SPI Bus during the adress phase of the write command. 0x0: Singl */
#define QSPIC2_QSPIC_WR_INST_TX_MD_MASK         (0x3 << 8) /* The mode of the SPI Bus during the instruction phase of the write command. 0x0:  */
#define QSPIC2_QSPIC_WR_INST_TX_MD_POS          (8) /* The mode of the SPI Bus during the instruction phase of the write command. 0x0:  */
#define QSPIC2_QSPIC_WR_INST_MASK               (0xFF << 0) /* This is the value of the instruction that is used, in order to be programmed the */
#define QSPIC2_QSPIC_WR_INST_POS                (0) /* This is the value of the instruction that is used, in order to be programmed the */

/* QSPIC2_BURSTBRK Register */

