AlmAck/svdtonuttx/demo/h/da1470x_qspic2.h
#define QSPIC2_QSPIC_SEC_HF_DS                  (1U << 20) /* Disable output during the transmission of the second half (QSPIC_BRK_WRD[3:0]).  */
#define QSPIC2_QSPIC_BRK_TX_MD_MASK             (0x3 << 18) /* The mode of the SPI Bus during the transmission of the read break sequence. 0x0: */
#define QSPIC2_QSPIC_BRK_TX_MD_POS              (18) /* The mode of the SPI Bus during the transmission of the read break sequence. 0x0: */
#define QSPIC2_QSPIC_BRK_SZ                     (1U << 17) /* The size of the read break sequence. 0: One byte (Send QSPIC_BRK_WRD[15:8]) 1: T */
#define QSPIC2_QSPIC_BRK_EN                     (1U << 16) /* Controls the application of a special command (read break sequence) that is used */
#define QSPIC2_QSPIC_BRK_WRD_MASK               (0xFFFF << 0) /* This is the value of a special command (read break sequence) that is applied by  */
#define QSPIC2_QSPIC_BRK_WRD_POS                (0) /* This is the value of a special command (read break sequence) that is applied by  */

/* QSPIC2_BURSTCMDA Register */

#define QSPIC2_QSPIC_DMY_TX_MD_MASK             (0x3 << 30) /* It describes the mode of the SPI bus during the Dummy bytes phase. 0x0: Single S */
#define QSPIC2_QSPIC_DMY_TX_MD_POS              (30) /* It describes the mode of the SPI bus during the Dummy bytes phase. 0x0: Single S */
#define QSPIC2_QSPIC_EXT_TX_MD_MASK             (0x3 << 28) /* It describes the mode of the SPI bus during the Extra Byte phase. 0x0: Single SP */
#define QSPIC2_QSPIC_EXT_TX_MD_POS              (28) /* It describes the mode of the SPI bus during the Extra Byte phase. 0x0: Single SP */
#define QSPIC2_QSPIC_ADR_TX_MD_MASK             (0x3 << 26) /* It describes the mode of the SPI bus during the address phase. 0x0: Single SPI 0 */
#define QSPIC2_QSPIC_ADR_TX_MD_POS              (26) /* It describes the mode of the SPI bus during the address phase. 0x0: Single SPI 0 */
#define QSPIC2_QSPIC_INST_TX_MD_MASK            (0x3 << 24) /* It describes the mode of the SPI bus during the instruction phase. 0x0: Single S */
#define QSPIC2_QSPIC_INST_TX_MD_POS             (24) /* It describes the mode of the SPI bus during the instruction phase. 0x0: Single S */
#define QSPIC2_QSPIC_EXT_BYTE_MASK              (0xFF << 16) /* The value of an extra byte which will be transferred after address (only if QSPI */
#define QSPIC2_QSPIC_EXT_BYTE_POS               (16) /* The value of an extra byte which will be transferred after address (only if QSPI */
#define QSPIC2_QSPIC_INST_WB_MASK               (0xFF << 8) /* Instruction Value for Wrapping Burst. This value is the selected instruction whe */
#define QSPIC2_QSPIC_INST_WB_POS                (8) /* Instruction Value for Wrapping Burst. This value is the selected instruction whe */
#define QSPIC2_QSPIC_INST_MASK                  (0xFF << 0) /* Instruction Value for Incremental Burst or Single read access. This value is the */
#define QSPIC2_QSPIC_INST_POS                   (0) /* Instruction Value for Incremental Burst or Single read access. This value is the */

/* QSPIC2_BURSTCMDB Register */

#define QSPIC2_QSPIC_DMY_FORCE                  (1U << 15) /* By setting this bit, the number of dummy bytes is forced to be equal to 3. In th */
#define QSPIC2_QSPIC_CS_HIGH_MIN_MASK           (0x7 << 12) /* Between the transmission of two different instructions to the flash memory, the  */
#define QSPIC2_QSPIC_CS_HIGH_MIN_POS            (12) /* Between the transmission of two different instructions to the flash memory, the  */
#define QSPIC2_QSPIC_WRAP_SIZE_MASK             (0x3 << 10) /* It describes the selected data size of a wrapping burst (QSPIC_WRAP_MD). 0x0: By */
#define QSPIC2_QSPIC_WRAP_SIZE_POS              (10) /* It describes the selected data size of a wrapping burst (QSPIC_WRAP_MD). 0x0: By */
#define QSPIC2_QSPIC_WRAP_LEN_MASK              (0x3 << 8) /* It describes the selected length of a wrapping burst (QSPIC_WRAP_MD). 0x0: 4 bea */
#define QSPIC2_QSPIC_WRAP_LEN_POS               (8) /* It describes the selected length of a wrapping burst (QSPIC_WRAP_MD). 0x0: 4 bea */
#define QSPIC2_QSPIC_WRAP_MD                    (1U << 7) /* Wrap mode 0: The QSPIC_INST is the selected instruction at any access. 1: The QS */
#define QSPIC2_QSPIC_INST_MD                    (1U << 6) /* Instruction mode 0: Transmit instruction at any burst access. 1: Transmit instru */
#define QSPIC2_QSPIC_DMY_NUM_MASK               (0x3 << 4) /* Number of Dummy Bytes  0x0: Zero Dummy Bytes (Don't Send Dummy Bytes) 0x1: Send  */
#define QSPIC2_QSPIC_DMY_NUM_POS                (4) /* Number of Dummy Bytes  0x0: Zero Dummy Bytes (Don't Send Dummy Bytes) 0x1: Send  */
#define QSPIC2_QSPIC_EXT_HF_DS                  (1U << 3) /* Extra Half Disable Output 0: if QSPIC_EXT_BYTE_EN=1 then transmit the complete Q */
#define QSPIC2_QSPIC_EXT_BYTE_EN                (1U << 2) /* Extra Byte Enable 0: Don't Send QSPIC_EXT_BYTE 1: Send QSPIC_EXT_BYTE */
#define QSPIC2_QSPIC_DAT_RX_MD_MASK             (0x3 << 0) /* It describes the mode of the SPI bus during the data phase. 0x0: Single SPI 0x1: */
#define QSPIC2_QSPIC_DAT_RX_MD_POS              (0) /* It describes the mode of the SPI bus during the data phase. 0x0: Single SPI 0x1: */

/* QSPIC2_CHCKERASE Register */

#define QSPIC2_QSPIC_CHCKERASE_MASK             (0xFFFFFFFF << 0) /* Writing any value to this register during erasing, forces the controller to read */
#define QSPIC2_QSPIC_CHCKERASE_POS              (0) /* Writing any value to this register during erasing, forces the controller to read */

/* QSPIC2_CTRLBUS Register */

#define QSPIC2_QSPIC_DIS_CS                     (1U << 4) /* Write 1 to disable the chip select (active low) when the controller is in Manual */
#define QSPIC2_QSPIC_EN_CS                      (1U << 3) /* Write 1 to enable the chip select (active low) when the controller is in Manual  */
#define QSPIC2_QSPIC_SET_QUAD                   (1U << 2) /* Write 1 to set the bus mode in Quad mode when the controller is in Manual mode. */
#define QSPIC2_QSPIC_SET_DUAL                   (1U << 1) /* Write 1 to set the bus mode in Dual mode when the controller is in Manual mode. */
#define QSPIC2_QSPIC_SET_SINGLE                 (1U << 0) /* Write 1 to set the bus mode in Single SPI mode when the controller is in Manual  */

/* QSPIC2_CTRLMODE Register */

