AlmAck/svdtonuttx/demo/h/da1470x_qspic2.h
#define QSPIC2_QSPIC_CLK_FREE_EN                (1U << 16) /* Controls the behavior of the QSPI_SCK when the QSPI_CS is high and the QSPIC_CS_ */
#define QSPIC2_QSPIC_CS_MD                      (1U << 15) /* Controls the clock edge with which is produced the QSPI_CS signal. 0: The QSPI_C */
#define QSPIC2_QSPIC_SRAM_EN                    (1U << 14) /* Defines the type of the external device that is connected on the QSPIC controlle */
#define QSPIC2_QSPIC_USE_32BA                   (1U << 13) /* Controls the length of the address that the external memory device uses. 0: The  */
#define QSPIC2_QSPIC_FORCENSEQ_EN               (1U << 12) /* Controls the way with which is addressed by the QSPI controller a burst request  */
#define QSPIC2_QSPIC_PCLK_MD_MASK               (0x7 << 9) /* Controls the read pipe clock delay relative to the falling edge of QSPI_SCK. Ref */
#define QSPIC2_QSPIC_PCLK_MD_POS                (9) /* Controls the read pipe clock delay relative to the falling edge of QSPI_SCK. Ref */
#define QSPIC2_QSPIC_RPIPE_EN                   (1U << 8) /* Controls the use of the data read pipe. 0: The read pipe is disabled, the sampli */
#define QSPIC2_QSPIC_RXD_NEG                    (1U << 7) /* Defines the clock edge that is used for the capturing of the received data, when */
#define QSPIC2_QSPIC_HRDY_MD                    (1U << 6) /* This configuration bit is useful when the frequency of the QSPI clock is much lo */
#define QSPIC2_QSPIC_IO3_DAT                    (1U << 5) /* The value of QSPI_IO3 pad if QSPI_IO3_OEN is 1 */
#define QSPIC2_QSPIC_IO2_DAT                    (1U << 4) /* The value of QSPI_IO2 pad if QSPI_IO2_OEN is 1 */
#define QSPIC2_QSPIC_IO3_OEN                    (1U << 3) /* QSPI_IO3 output enable. Use this only in SPI or Dual SPI mode to control /HOLD s */
#define QSPIC2_QSPIC_IO2_OEN                    (1U << 2) /* QSPI_IO2 output enable. Use this only in SPI or Dual SPI mode to control /WP sig */
#define QSPIC2_QSPIC_CLK_MD                     (1U << 1) /* Mode of the generated QSPI_SCK clock  0: Use Mode 0 for the QSPI_CLK. The QSPI_S */
#define QSPIC2_QSPIC_AUTO_MD                    (1U << 0) /* Mode of operation 0: The Manual Mode is selected. 1: The Auto Mode is selected.  */

/* QSPIC2_DUMMYDATA Register */

#define QSPIC2_QSPIC_DUMMYDATA_MASK             (0xFFFFFFFF << 0) /* Writing to this register generates a number of clock pulses to the SPI bus. Duri */
#define QSPIC2_QSPIC_DUMMYDATA_POS              (0) /* Writing to this register generates a number of clock pulses to the SPI bus. Duri */

/* QSPIC2_ERASECMDA Register */

#define QSPIC2_QSPIC_RES_INST_MASK              (0xFF << 24) /* The code value of the erase resume instruction */
#define QSPIC2_QSPIC_RES_INST_POS               (24) /* The code value of the erase resume instruction */
#define QSPIC2_QSPIC_SUS_INST_MASK              (0xFF << 16) /* The code value of the erase suspend instruction. */
#define QSPIC2_QSPIC_SUS_INST_POS               (16) /* The code value of the erase suspend instruction. */
#define QSPIC2_QSPIC_WEN_INST_MASK              (0xFF << 8) /* The code value of the write enable instruction. */
#define QSPIC2_QSPIC_WEN_INST_POS               (8) /* The code value of the write enable instruction. */
#define QSPIC2_QSPIC_ERS_INST_MASK              (0xFF << 0) /* The code value of the erase instruction. */
#define QSPIC2_QSPIC_ERS_INST_POS               (0) /* The code value of the erase instruction. */

/* QSPIC2_ERASECMDB Register */

#define QSPIC2_QSPIC_RESSUS_DLY_MASK            (0x3F << 24) /* Defines a timer that counts the minimum allowed delay between an erase suspend c */
#define QSPIC2_QSPIC_RESSUS_DLY_POS             (24) /* Defines a timer that counts the minimum allowed delay between an erase suspend c */
#define QSPIC2_QSPIC_ERSRES_HLD_MASK            (0xF << 16) /* The controller must stay without flash memory reading requests for this number o */
#define QSPIC2_QSPIC_ERSRES_HLD_POS             (16) /* The controller must stay without flash memory reading requests for this number o */
#define QSPIC2_QSPIC_ERS_CS_HI_MASK             (0x1F << 10) /* After the execution of instructions: write enable, erase, erase suspend and eras */
#define QSPIC2_QSPIC_ERS_CS_HI_POS              (10) /* After the execution of instructions: write enable, erase, erase suspend and eras */
#define QSPIC2_QSPIC_EAD_TX_MD_MASK             (0x3 << 8) /* The mode of the SPI Bus during the address phase of the erase instruction 0x0: S */
#define QSPIC2_QSPIC_EAD_TX_MD_POS              (8) /* The mode of the SPI Bus during the address phase of the erase instruction 0x0: S */
#define QSPIC2_QSPIC_RES_TX_MD_MASK             (0x3 << 6) /* The mode of the SPI Bus during the transmission of the resume instruction 0x0: S */
#define QSPIC2_QSPIC_RES_TX_MD_POS              (6) /* The mode of the SPI Bus during the transmission of the resume instruction 0x0: S */
#define QSPIC2_QSPIC_SUS_TX_MD_MASK             (0x3 << 4) /* The mode of the SPI Bus during the transmission of the suspend instruction. 0x0: */
#define QSPIC2_QSPIC_SUS_TX_MD_POS              (4) /* The mode of the SPI Bus during the transmission of the suspend instruction. 0x0: */
#define QSPIC2_QSPIC_WEN_TX_MD_MASK             (0x3 << 2) /* The mode of the SPI Bus during the transmission of the write enable instruction. */
#define QSPIC2_QSPIC_WEN_TX_MD_POS              (2) /* The mode of the SPI Bus during the transmission of the write enable instruction. */
#define QSPIC2_QSPIC_ERS_TX_MD_MASK             (0x3 << 0) /* The mode of the SPI Bus during the instruction phase of the erase instruction 0x */
#define QSPIC2_QSPIC_ERS_TX_MD_POS              (0) /* The mode of the SPI Bus during the instruction phase of the erase instruction 0x */

/* QSPIC2_ERASECTRL Register */

#define QSPIC2_QSPIC_ERS_STATE_MASK             (0x7 << 25) /* It shows the progress of sector/block erasing (read only). 0x0: No Erase. 0x1: P */
#define QSPIC2_QSPIC_ERS_STATE_POS              (25) /* It shows the progress of sector/block erasing (read only). 0x0: No Erase. 0x1: P */
#define QSPIC2_QSPIC_ERASE_EN                   (1U << 24) /* This bit has meaning only when the external device is a serial FLASH (QSPIC_SRAM */
#define QSPIC2_QSPIC_ERS_ADDR_MASK              (0xFFFFF << 4) /* Defines the address of the block/sector that is requested to be erased. If QSPIC */
#define QSPIC2_QSPIC_ERS_ADDR_POS               (4) /* Defines the address of the block/sector that is requested to be erased. If QSPIC */

/* QSPIC2_GP Register */

#define QSPIC2_QSPIC_PADS_SLEW_MASK             (0x3 << 3) /* QSPI pads slew rate control. Indicative values under certain conditions: 0x0 : R */
#define QSPIC2_QSPIC_PADS_SLEW_POS              (3) /* QSPI pads slew rate control. Indicative values under certain conditions: 0x0 : R */
#define QSPIC2_QSPIC_PADS_DRV_MASK              (0x3 << 1) /* QSPI pads drive current 0x0 : 4 mA 0x1 : 8 mA 0x2 : 12 mA 0x3 : 16 mA */
#define QSPIC2_QSPIC_PADS_DRV_POS               (1) /* QSPI pads drive current 0x0 : 4 mA 0x1 : 8 mA 0x2 : 12 mA 0x3 : 16 mA */

/* QSPIC2_MEMBLEN Register */

#define QSPIC2_QSPIC_T_CEM_CC_MASK              (0x3FF << 4) /* Defines the maximum allowed time tCEM for which the QSPIC_CS can stay active (QS */
#define QSPIC2_QSPIC_T_CEM_CC_POS               (4) /* Defines the maximum allowed time tCEM for which the QSPIC_CS can stay active (QS */
#define QSPIC2_QSPIC_T_CEM_EN                   (1U << 3) /* This bit enables the controlling of the maximum time tCEM for which the QSPI_CS  */
#define QSPIC2_QSPIC_MEMBLEN_MASK               (0x7 << 0) /* In this register is defined the expected behavior of the external memory device  */
#define QSPIC2_QSPIC_MEMBLEN_POS                (0) /* In this register is defined the expected behavior of the external memory device  */

/* QSPIC2_READDATA Register */

#define QSPIC2_QSPIC_READDATA_MASK              (0xFFFFFFFF << 0) /* A read access at this register generates a data transfer from the external memor */
#define QSPIC2_QSPIC_READDATA_POS               (0) /* A read access at this register generates a data transfer from the external memor */

