AlmAck/svdtonuttx/demo/h/da1470x_qspic2.h
/* QSPIC2_RECVDATA Register */

#define QSPIC2_QSPIC_RECVDATA_MASK              (0xFFFFFFFF << 0) /* This register contains the received data when the QSPIC_READDATA_REG register is */
#define QSPIC2_QSPIC_RECVDATA_POS               (0) /* This register contains the received data when the QSPIC_READDATA_REG register is */

/* QSPIC2_STATUSCMD Register */

#define QSPIC2_QSPIC_STSDLY_SEL                 (1U << 22) /* Defines the timer which is used to count the delay that it has to wait before to */
#define QSPIC2_QSPIC_RESSTS_DLY_MASK            (0x3F << 16) /* Defines a timer that counts the minimum required delay between the reading of th */
#define QSPIC2_QSPIC_RESSTS_DLY_POS             (16) /* Defines a timer that counts the minimum required delay between the reading of th */
#define QSPIC2_QSPIC_BUSY_VAL                   (1U << 15) /* Defines the value of the Busy bit which means that the flash is busy. 0: The fla */
#define QSPIC2_QSPIC_BUSY_POS_MASK              (0x7 << 12) /* Defines the bit of the Flash status register which represents the Busy bit (0x7  */
#define QSPIC2_QSPIC_BUSY_POS_POS               (12) /* Defines the bit of the Flash status register which represents the Busy bit (0x7  */
#define QSPIC2_QSPIC_RSTAT_RX_MD_MASK           (0x3 << 10) /* The mode of the SPI Bus during the reception phase of the read status instructio */
#define QSPIC2_QSPIC_RSTAT_RX_MD_POS            (10) /* The mode of the SPI Bus during the reception phase of the read status instructio */
#define QSPIC2_QSPIC_RSTAT_TX_MD_MASK           (0x3 << 8) /* The mode of the SPI Bus during the instruction phase of the read status instruct */
#define QSPIC2_QSPIC_RSTAT_TX_MD_POS            (8) /* The mode of the SPI Bus during the instruction phase of the read status instruct */
#define QSPIC2_QSPIC_RSTAT_INST_MASK            (0xFF << 0) /* The code value of the read status instruction. It is transmitted during the inst */
#define QSPIC2_QSPIC_RSTAT_INST_POS             (0) /* The code value of the read status instruction. It is transmitted during the inst */

/* QSPIC2_STATUS Register */

#define QSPIC2_QSPIC_BUSY                       (1U << 0) /* The status of the SPI Bus.  0: The SPI Bus is idle 1: The SPI Bus is active. Rea */

/* QSPIC2_WRITEDATA Register */

#define QSPIC2_QSPIC_WRITEDATA_MASK             (0xFFFFFFFF << 0) /* Writing to this register is generating a data transfer from the controller to th */
#define QSPIC2_QSPIC_WRITEDATA_POS              (0) /* Writing to this register is generating a data transfer from the controller to th */

#endif /* __DA1470X_QSPIC2_H */
